### 📖 Terraform Plan (src/core/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_resource_group.acr_weu will be created
  + resource "azurerm_resource_group" "acr_weu" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "io-p-container-registry-rg"
      + tags     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_platform_kv_01_cd_key["19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_platform_kv_01_cd_key" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "19c9e57c-3b95-4cb4-9408-f596f1cc8f8f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-platform-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.key_vault_weu.azurerm_role_assignment.io_p_itn_platform_kv_01_ci_key["8d5d04c7-98f7-4f27-91ae-249231d96918"] will be created
  + resource "azurerm_role_assignment" "io_p_itn_platform_kv_01_ci_key" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8d5d04c7-98f7-4f27-91ae-249231d96918"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-platform-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ resource_groups    = {
      ~ westeurope = {
          + acr            = "io-p-container-registry-rg"
            # (8 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)
    }

Warning: Argument is deprecated

  with module.azdoa_weu.module.azdoa_snet.azurerm_subnet.this,
  on .terraform/modules/azdoa_weu.azdoa_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 11 more similar warnings elsewhere)
```

</details>
